#include <iostream>
using namespace std;

// If 22
// Дано координати точки, що не лежить на координатних осях OX та OY.
// Визначити номер координатної чверті, в якій знаходиться дана точка.
void task_if22() {
  double x, y;
  cout << "********** If 22 **********" << endl;
  cout << "Введіть значення Х: ";
  cin >> x;
  // Перевірка некоректного введення / координати на осі OX
  if (cin.fail() || x == 0) {
    cerr << "Некоректні дані!" << endl;
    return;
  }
  // Перевірка некоректного введення / координати на осі OY
  cout << "Введіть значення Y: ";
  cin >> y;
  if (cin.fail() || y == 0) {
    cerr << "Некоректні дані!" << endl;
    return;
  }
  // Розрахунок чверті
  int quarter;
  if (x > 0){
    if (y > 0) quarter = 1;
    else quarter = 4;
  } else {
    if (y > 0) quarter = 2;
    else quarter = 3;
  }
  cout << "Точка лежить в " << quarter << " координатній чверті" << endl;
}


// Geom 19
// Дано координати точки на площині (x, y).
// Визначити, чи потрапляє точка в фігуру заданого кольору (або групу фігур)
// і вивести відповідне повідомлення.
void task_geom19() {
  double x, y, r;
  cout << "********** Geom 19 **********" << endl;
  cout << "Введіть значення Х: ";
  cin >> x;
  if (cin.fail()) {
    cerr << "Некоректні дані!" << endl;
    return;
  }
  cout << "Введіть значення Y: ";
  cin >> y;
  if (cin.fail()) {
    cerr << "Некоректні дані!" << endl;
    return;
  }
  // Перевірка некоректного введення / введеня радіуса менше 0
  cout << "Введіть значення R: ";
  cin >> r;
  if (cin.fail() || r <= 0) {
    cerr << "Некоректні дані!" << endl;
    return;
  }
  // Перша умова - Х >= 0 && X <= R
  if (x < 0 || x > r) {
    cout << "Точка НЕ лежить в області";
    return;
  }
  // Друга умова - Y >= -2R && Y <= R
  if (y < -2 * r || y > r) {
    cout << "Точка НЕ лежить в області";
    return;
  }
  // Третя умова - точка не лежить у колі в першій чверті
  if (((x - r) * (x - r) + (y - r) * (y - r)) <= r * r) {
    cout << "Точка НЕ лежить в області";
    return;
  }
  // Четверта умова - X < R - Y
  if (x > r - y) {
    cout << "Точка НЕ лежить в області";
    return;
  }
  cout << "Точка лежить в області";
}

int main() {
  int menu;
  cout << "Номер завдання: ";
  cin >> menu;
  // перемикання між завданнями
  switch(menu) {
    case 1: task_if22(); break;
    case 2: task_geom19(); break;
    default: cout << "Невірний номер завдання! (Тільки 1, 2)" << endl;
  }
  return 0;
}
